In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Ross, Mr. John Hugo",male,NaN,NaN,NaN,1601,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [5]:
df.drop(['PassengerId','Cabin','Name','Ticket'],axis=1,inplace=True)

In [6]:
df_test=pd.read_csv("test.csv")

In [7]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [17]:
df_test.drop(['Cabin','Name','Ticket'],axis=1,inplace=True)

In [10]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [8]:
df_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [11]:
X=df.iloc[:,[1,2,3,4,5,6,7]].values
y=df.iloc[:,0].values

In [12]:
X_test=df_test.iloc[:,[1,3,4,5,6,8,10]].values

In [13]:
#from sklearn.preprocessing import Imputer
from sklearn.impute import SimpleImputer
imputer1 = SimpleImputer(missing_values = np.nan, strategy = 'mean')
imputer1 = imputer1.fit(X[:,[2]])
X[:,[2]] = imputer1.transform(X[:,[2]])
imputer_1 = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
imputer_1 = imputer_1.fit(X[:,[6]])
X[:,[6]] = imputer_1.transform(X[:,[6]])

In [14]:
imputer2 = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
imputer2 = imputer1.fit(X_test[:,[2,5]])
X_test[:,[2,5]] = imputer1.transform(X_test[:,[2,5]])

In [15]:
def label_encoder(X):
    from sklearn.preprocessing import LabelEncoder#,OneHotEncoder
    label_X1=LabelEncoder()
    X[:,1]=label_X1.fit_transform(X[:,1])
    label_X2=LabelEncoder()
    X[:,6]=label_X2.fit_transform(X[:,6])
    return X

In [16]:
label_encoder(X)

array([[3, 1, 22.0, ..., 0, 7.25, 2],
       [1, 0, 38.0, ..., 0, 71.2833, 0],
       [3, 0, 26.0, ..., 0, 7.925, 2],
       ...,
       [3, 0, 29.69911764705882, ..., 2, 23.45, 2],
       [1, 1, 26.0, ..., 0, 30.0, 0],
       [3, 1, 32.0, ..., 0, 7.75, 1]], dtype=object)

In [17]:
label_encoder(X_test)

array([[3, 1, 34.5, ..., 0, 7.8292, 1],
       [3, 0, 47.0, ..., 0, 7.0, 2],
       [2, 1, 62.0, ..., 0, 9.6875, 1],
       ...,
       [3, 1, 38.5, ..., 0, 7.25, 2],
       [3, 1, 30.272590361445783, ..., 0, 8.05, 2],
       [3, 1, 30.272590361445783, ..., 1, 22.3583, 0]], dtype=object)

In [18]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(random_state=0)

In [19]:
classifier.fit(X, y)

/home/pallavi/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=0, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [20]:
y_test=classifier.predict(X_test)

In [21]:
data_out = pd.DataFrame({'PassengerId': df_test['PassengerId'] , 'Survived': y_test})
data_out.to_csv('attemp2.csv', index = None)